In [1]:
# %matplotlib inline
import pandas as pd

### Download the data and load it to Pandas. 

You can find them [here](https://drive.google.com/file/d/1NY6cmF9Shjw-dD7BD6bNmfcIVz-kQcFR/view?usp=sharing).

In [2]:
titles = pd.read_csv('titles.csv')
titles.head()

                     title  year
0           The Rising Son  1990
1  The Thousand Plane Raid  1969
2         Crucea de piatra  1993
3                  Country  2000
4               Gaiking II  2011

In [3]:
cast = pd.read_csv('cast.csv', sep=",")
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4   NaN
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

### How many movies are listed in the titles dataframe?

In [4]:
titles["title"].nunique()

212418

In [6]:
titles.sort_values(by='title')

                             title  year
143219            #1 Serial Killer  2013
64031                         #227  2020
163524                          #5  2013
87059                   #50Fathers  2015
72341                          #66  2015
...                            ...   ...
108299  xXx: Return of Xander Cage  2017
25314      xXx: State of the Union  2005
226408                           y  2016
221598        yek taebir asheghane  2017
64163            zire saghfe doodi  2017

[232330 rows x 2 columns]

### What are the earliest two films listed in the titles dataframe?

In [7]:
titles[['title','year']].sort_values(by='year')

                                                    title  year
177757                                         Miss Jerry  1894
215272                                 The Startled Lover  1898
124505     Reproduction of the Corbett and Jeffries Fight  1899
20657   Pierrot's Problem, or How to Make a Fat Wife O...  1900
13599                                Family Troubles (II)  1900
...                                                   ...   ...
10754                       Hyperion: The Wrath of Kronos  2024
229718                                         Gods Heart  2025
145689                                        Rise of Man  2025
102561                                  Settling of Score  2026
65488                                         War in Snow  2026

[232330 rows x 2 columns]

### How many movies have the title "Hamlet"?

In [8]:
titles[titles['title'] == 'Hamlet']

         title  year
6009    Hamlet  1948
45350   Hamlet  1990
46721   Hamlet  1910
92146   Hamlet  1976
94355   Hamlet  1987
94554   Hamlet  2000
98554   Hamlet  1921
102919  Hamlet  2011
122704  Hamlet  1969
128388  Hamlet  1954
166410  Hamlet  1913
168965  Hamlet  2015
176069  Hamlet  2009
182970  Hamlet  1964
201291  Hamlet  1996
209878  Hamlet  1911
221479  Hamlet  1973
223568  Hamlet  2014

### How many movies are titled "North by Northwest"?

In [9]:
titles[titles['title'] == 'North by Northwest'].nunique()

title    1
year     1
dtype: int64

### When was the first movie titled "Hamlet" made?

In [24]:
titles[titles['title'] == 'Hamlet'].sort_values(by='year')

         title  year
46721   Hamlet  1910
209878  Hamlet  1911
166410  Hamlet  1913
98554   Hamlet  1921
6009    Hamlet  1948
128388  Hamlet  1954
182970  Hamlet  1964
122704  Hamlet  1969
221479  Hamlet  1973
92146   Hamlet  1976
94355   Hamlet  1987
45350   Hamlet  1990
201291  Hamlet  1996
94554   Hamlet  2000
176069  Hamlet  2009
102919  Hamlet  2011
223568  Hamlet  2014
168965  Hamlet  2015

### List all of the "Treasure Island" movies from earliest to most recent.

In [25]:
titles[titles['title'] == 'Treasure Island'].sort_values(by='year')

                  title  year
206027  Treasure Island  1918
51287   Treasure Island  1920
191050  Treasure Island  1934
96934   Treasure Island  1950
89534   Treasure Island  1972
111343  Treasure Island  1973
205397  Treasure Island  1985
179354  Treasure Island  1999

### How many movies were made in the year 1950?

In [28]:
titles[titles['year'] == 1950].nunique()

title    1099
year        1
dtype: int64

### How many movies were made in the year 1960?

In [29]:
titles[titles['year'] == 1960].nunique()

title    1501
year        1
dtype: int64

### How many movies were made from 1950 through 1959?

In [36]:
filtered_titles = titles[titles['year'].between(1951, 1959)]
filtered_titles

                                         title  year
40      La momia azteca contra el robot humano  1958
45                                 Mavi boncuk  1958
92                         Perdeu-se um Marido  1957
113                             Qiu yu can hua  1953
115                                 Hi no tori  1956
...                                        ...   ...
232174               Dimas: The Sainted Robber  1952
232196                    Tischlein, deck dich  1956
232231                        Some Like It Hot  1959
232260                             Black Widow  1951
232291                       Te sigo esperando  1952

[11612 rows x 2 columns]

### In what years has a movie titled "Batman" been released?

In [38]:
titles[titles['title']=="Batman"]

        title  year
56000  Batman  1989
74608  Batman  1943

### How many roles were there in the movie "Inception"?

In [43]:
filtered_titles = cast[cast['title']=="Inception"]
filtered_titles["character"].nunique()

55

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [47]:
filtered_titles = cast[cast['title'] == "Inception"]
unranked_roles = filtered_titles[filtered_titles['n'].isnull()]
num_unranked_roles = len(unranked_roles)

print("Number of roles in the movie 'Inception' not ranked by an 'n' value:", num_unranked_roles)

Number of roles in the movie 'Inception' not ranked by an 'n' value: 26

### But how many roles in the movie "Inception" did receive an "n" value?

In [48]:
filtered_titles = cast[cast['title'] == "Inception"]
ranked_roles = filtered_titles[filtered_titles['n'].notnull()]
num_ranked_roles = len(ranked_roles)

print("Number of roles in the movie 'Inception' with an 'n' value:", num_ranked_roles)

Number of roles in the movie 'Inception' with an 'n' value: 51

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [50]:
filtered_titles = cast[cast['title'] == "North by Northwest"]
ranked_roles = filtered_titles[filtered_titles['n'].notnull()]
ranked_roles.sort_values(by='n')

,title,year,name,type,character,n
845516,North by Northwest,1959,Cary Grant,actor,Roger O. Thornhill,1.0
3382934,North by Northwest,1959,Eva Marie Saint,actress,Eve Kendall,2.0
1413409,North by Northwest,1959,James Mason,actor,Phillip Vandamm,3.0
3043261,North by Northwest,1959,Jessie Royce Landis,actress,Clara Thornhill,4.0
345822,North by Northwest,1959,Leo G. Carroll,actor,The Professor,5.0
2941468,North by Northwest,1959,Josephine Hutchinson,actress,Mrs. Townsend,6.0
1644542,North by Northwest,1959,Philip Ober,actor,Lester Townsend,7.0
1236791,North by Northwest,1959,Martin Landau,actor,Leonard,8.0
2372617,North by Northwest,1959,Adam Williams,actor,Valerian,9.0
1757154,North by Northwest,1959,Edward Platt,actor,Victor Larrabee,10.0
646039,North by Northwest,1959,Robert Ellenstein,actor,Licht,11.0
2225858,North by Northwest,1959,Les Tremayne,actor,Auctioneer,12.0
450691,North by Northwest,1959,Philip Coolidge,actor,Dr. Cross,13.0
1463316,North by Northwest,1959,Patrick McVey,actor,Sergeant Flamm,14.0
199768,North by Northwest,1959,Edward Binns,actor,Captain Junket,15.0
1343025,North by Northwest,1959,Ken Lynch,actor,Charley - Chicago Policeman,16.0

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [64]:
filtered_titles = cast[(cast['title'] == "Sleuth") & (cast['year']==1972)]
filtered_titles.sort_values('n')

,title,year,name,type,character,n
1654402,Sleuth,1972,Laurence Olivier,actor,Andrew Wyke,1.0
316652,Sleuth,1972,Michael Caine,actor,Milo Tindle,2.0
362592,Sleuth,1972,Alec Cawthorne,actor,Inspector Doppler,3.0
1421434,Sleuth,1972,John (II) Matthews,actor,Detective Sergeant Tarrant,4.0
2635708,Sleuth,1972,Eve (III) Channing,actress,Marguerite Wyke,5.0
1405219,Sleuth,1972,Teddy Martin,actor,Police Constable Higgs,6.0

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [65]:
filtered_titles = cast[(cast['title'] == "Sleuth") & (cast['year']==2007)]
filtered_titles.sort_values('n')

          title  year                 name     type          character    n
316653   Sleuth  2007        Michael Caine    actor             Andrew  1.0
1254632  Sleuth  2007             Jude Law    actor               Milo  2.0
1751872  Sleuth  2007        Harold Pinter    actor        Man on T.V.  3.0
251883   Sleuth  2007      Kenneth Branagh    actor  Other Man on T.V.  NaN
362593   Sleuth  2007  Alec (II) Cawthorne    actor  Inspector Doppler  NaN
2635707  Sleuth  2007    Eve (II) Channing  actress    Marguerite Wyke  NaN
3244050  Sleuth  2007    Carmel O'Sullivan  actress             Maggie  NaN

### How many roles were credited in the silent 1921 version of Hamlet?

In [68]:
filtered_titles = cast[(cast['title'] == "Hamlet") & (cast['year']==1921)]
filtered_titles.nunique()

title        1
year         1
name         9
type         2
character    9
n            9
dtype: int64

### How many roles were credited in Branagh’s 1996 Hamlet?

In [69]:
filtered_titles = cast[(cast['title'] == "Hamlet") & (cast['year']==1996)]
filtered_titles.nunique()

title         1
year          1
name         54
type          2
character    49
n            46
dtype: int64

### How many "Hamlet" roles have been listed in all film credits through history?

In [72]:
filtered_titles = cast[(cast['title'] == "Hamlet") & (cast['year']==1921)]
filtered_titles.nunique()

title        72
year         46
name         92
type          2
character     1
n            22
dtype: int64

### How many people have played an "Ophelia"?

In [73]:
filtered_titles = cast[(cast['character'] == "Ophelia")]
filtered_titles.nunique()

title         92
year          48
name         109
type           2
character      1
n             23
dtype: int64

### How many people have played a role called "The Dude"?

In [78]:
filtered_titles = cast[(cast['character'] == "The Dude")]
filtered_titles

,title,year,name,type,character,n
263434,The Big Lebowski,1998,Jeff Bridges,actor,The Dude,1.0
328939,Terms & Conditions,2015,Jordan Cann,actor,The Dude,9.0
483781,Stranger,2000,Scott Crowell,actor,The Dude,NaN
553260,Pizza Man vs. the Dude,2004,Chris DeMarcus,actor,The Dude,NaN
592594,Sweepstakes,1931,Mike Donlin,actor,The Dude,12.0
610856,Self Helpless,2010,Devin The Dude,actor,The Dude,NaN
1057654,Jay and Silent Bob Strike Back,2001,Matthew (XIX) James,actor,The Dude,37.0
1105485,Explicit Ills,2008,Christopher Kadish,actor,The Dude,27.0
1325956,American Idiots,2013,Jason Loughridge,actor,The Dude,10.0
1344790,The Winds of Autumn,1976,Steve Lyons,actor,The Dude,30.0
1467445,The Liq,2016,Mark Alan Meek,actor,The Dude,NaN
1494898,Wild Oats Lane,1926,Jerry Miley,actor,The Dude,6.0
1731068,Oklahoma Badlands,1948,House Peters Jr.,actor,The Dude,13.0
1770139,Cloud Air: The Movie,2013,Thomas (VIII) Porter,actor,The Dude,8.0
1783848,Hacks,1997,Jason Priestley,actor,The Dude,11.0
2135620,Carlos Spills the Beans,2012,Bobby Styles,actor,The Dude,NaN
2264997,Zachariah,1971,Dick Van Patten,actor,The Dude,9.0
2345440,It Can Be Arranged,2010,Joel Weiss,actor,The Dude,NaN

### How many people have played a role called "The Stranger"?

In [77]:
filtered_titles = cast[(cast['character'] == "The Stranger")]
filtered_titles

,title,year,name,type,character,n
25003,Theeb,2014,Hassan Mutlag Al-Maraiyeh,actor,The Stranger,3.0
34533,My Time to Die,2014,Vincent H. Alexander,actor,The Stranger,2.0
65182,Get Mean,1975,Tony Anthony,actor,The Stranger,1.0
65185,Lo straniero di silenzio,1968,Tony Anthony,actor,The Stranger,1.0
65187,Un dollaro tra i denti,1967,Tony Anthony,actor,The Stranger,1.0
...,...,...,...,...,...,...
3087925,The Stranger,1995,Kathy Long,actress,The Stranger,1.0
3101453,Ever Since Eve,1921,Ethel Lynne,actress,The Stranger,7.0
3277027,Weitertanzen,2008,Rosa Maria Paz,actress,The Stranger,NaN
3297806,The Godsend,1980,Angela Pleasence,actress,The Stranger,3.0
3429093,Motherland,1927,Dorinea Shirley,actress,The Stranger,NaN

### How many roles has Sidney Poitier played throughout his career?

In [82]:
filtered = cast[cast["name"]=="Sidney Poitier"]
filtered.nunique()

title        43
year         30
name          1
type          1
character    41
n             8
dtype: int64

### How many roles has Judi Dench played?

In [83]:
filtered = cast[cast["name"]=="Judi Dench"]
filtered.nunique()

title        54
year         27
name          1
type          1
character    45
n            18
dtype: int64

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [23]:
filtered_roles = cast[(cast['name']=="Cary Grant")&(cast['n']==2)]
filtered_roles = filtered_roles['year'].between(1940,1950)
filtered_roles

845481    False
845482    False
845489    False
845496    False
845500    False
845501    False
845506    False
845513     True
845523     True
845526    False
845530    False
845534    False
845537    False
845544    False
845545    False
845546    False
845550    False
845554    False
845555    False
845556    False
Name: year, dtype: bool

### List the leading roles that Cary Grant played in the 1940s in order by year.

### How many roles were available for actors in the 1950s?

### How many roles were avilable for actresses in the 1950s?

### How many leading roles (n=1) were available from the beginning of film history through 1980?

### How many non-leading roles were available through from the beginning of film history through 1980?

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?